Public Member Functions | Static Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::v1::DuctElbowPreferenceTable Class Referencefinal
MEP Element Manager
The DuctElbowPreferenceTable contains cross section related information for Duct elbows. More...
#include <MEPDuctElbowPreferenceTable.hpp>
 Inheritance diagram for ACAPI::MEP::v1::DuctElbowPreferenceTable:
 Public Member Functions
bool  | Exists () const
Result< void >  | IsEditable () const
GS::UniString  | GetName () const
uint32_t  | GetSize () const
Result< uint32_t >  | GetReferenceId (uint32_t index) const
Result< bool >  | IsRowValid (uint32_t index) const
A row is considered valid if its diameter and radius contains non-zero values, description is optional.
Result< bool >  | IsRowValidByReferenceId (uint32_t referenceId) const
A row is considered valid if its diameter and radius contains non-zero values, description is optional.
Result< double >  | GetDiameter (uint32_t index) const
Result< double >  | GetDiameterByReferenceId (uint32_t referenceId) const
Result< double >  | GetRadius (uint32_t index) const
Result< double >  | GetRadiusByReferenceId (uint32_t referenceId) const
Result< GS::UniString >  | GetDescription (uint32_t index) const
Result< GS::UniString >  | GetDescriptionByReferenceId (uint32_t referenceId) const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
void  | SetName (const GS::UniString &tableName)
Sets the name of the table.
Result< void >  | EmptyRow (uint32_t index)
Empties a row from the table.
Result< void >  | EmptyRowByReferenceId (uint32_t referenceId)
Empties a row from the table.
Result< void >  | SetDiameter (uint32_t index, double diameter)
Sets the diameter value of a table's row.
Result< void >  | SetDiameterByReferenceId (uint32_t referenceId, double diameter)
Sets the diameter value of a table's row.
Result< void >  | SetRadius (uint32_t index, double radius)
Sets the radius value of a table's row.
Result< void >  | SetRadiusByReferenceId (uint32_t referenceId, double radius)
Sets the radius value of a table's row.
Result< void >  | SetDescription (uint32_t index, const GS::UniString &description)
Sets the description of a table's row.
Result< void >  | SetDescriptionByReferenceId (uint32_t referenceId, const GS::UniString &description)
Sets the description of a table's row.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static Result< DuctElbowPreferenceTable >  | Get (const UniqueID &uniqueId)
Returns a DuctElbowPreferenceTable.
 Protected Member Functions
Modifier (DuctElbowPreferenceTable &parent)
Constructs a Modifier with the given DuctElbowPreferenceTable.
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The DuctElbowPreferenceTable contains cross section related information for Duct elbows.
Since
Archicad 28
The table uses the keys defined by the DuctReferenceSet. To consider a table row usable and valid, it should have all its fields filled, beside its description, which is optional.
Example code snippet from Test / New MEP
Take a look at PreferenceTableContainerBase
Member Function Documentation
◆ EmptyRow()
 Result< void > ACAPI::MEP::v1::DuctElbowPreferenceTable::EmptyRow  |  ( |  uint32_t  |  index | )
Empties a row from the table.
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ EmptyRowByReferenceId()
 Result< void > ACAPI::MEP::v1::DuctElbowPreferenceTable::EmptyRowByReferenceId  |  ( |  uint32_t  |  referenceId | )
Empties a row from the table.
Parameters
referenceId | The referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
Returns
Returns error if the referenceId is not in the table, otherwise nothing.
◆ Exists()
 bool ACAPI::MEP::v1::DuctElbowPreferenceTable::Exists  |  ( |   | ) |   const
Returns
Checks if the object still exists.
◆ Get()
 static Result< DuctElbowPreferenceTable > ACAPI::MEP::v1::DuctElbowPreferenceTable::Get  |  ( |  const UniqueID &  |  uniqueId | )
static
Returns a DuctElbowPreferenceTable.
Parameters
uniqueId | The UniqueID of the requested DuctElbowPreferenceTable.
Returns
If the uniqueId belongs to a DuctElbowPreferenceTable, returns the object associated to it, otherwise Error.
◆ GetDescription()
 Result< GS::UniString > ACAPI::MEP::v1::DuctElbowPreferenceTable::GetDescription  |  ( |  uint32_t  |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the description of the table's row.
◆ GetDescriptionByReferenceId()
 Result< GS::UniString > ACAPI::MEP::v1::DuctElbowPreferenceTable::GetDescriptionByReferenceId  |  ( |  uint32_t  |  referenceId | ) |   const
Parameters
referenceId | The referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
Returns
Returns error if the referenceId is not in the table, otherwise returns the description of the table's row.
◆ GetDiameter()
 Result< double > ACAPI::MEP::v1::DuctElbowPreferenceTable::GetDiameter  |  ( |  uint32_t  |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the diameter value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetDiameterByReferenceId()
 Result< double > ACAPI::MEP::v1::DuctElbowPreferenceTable::GetDiameterByReferenceId  |  ( |  uint32_t  |  referenceId | ) |   const
Parameters
referenceId | The referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
Returns
Returns error if the referenceId is not in the table, otherwise returns the diameter value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetName()
 GS::UniString ACAPI::MEP::v1::DuctElbowPreferenceTable::GetName  |  ( |   | ) |   const
Returns
Returns the name of the table.
◆ GetRadius()
 Result< double > ACAPI::MEP::v1::DuctElbowPreferenceTable::GetRadius  |  ( |  uint32_t  |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the radius value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetRadiusByReferenceId()
 Result< double > ACAPI::MEP::v1::DuctElbowPreferenceTable::GetRadiusByReferenceId  |  ( |  uint32_t  |  referenceId | ) |   const
Parameters
referenceId | The referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
Returns
Returns error if the referenceId is not in the table, otherwise returns the radius value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetReferenceId()
 Result< uint32_t > ACAPI::MEP::v1::DuctElbowPreferenceTable::GetReferenceId  |  ( |  uint32_t  |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the referenceId of the table's row.
◆ GetSize()
 uint32_t ACAPI::MEP::v1::DuctElbowPreferenceTable::GetSize  |  ( |   | ) |   const
Returns
Returns the size of table.
◆ IsEditable()
 Result< void > ACAPI::MEP::v1::DuctElbowPreferenceTable::IsEditable  |  ( |   | ) |   const
Returns
Checks if the object currently is editable.
◆ IsRowValid()
 Result< bool > ACAPI::MEP::v1::DuctElbowPreferenceTable::IsRowValid  |  ( |  uint32_t  |  index | ) |   const
A row is considered valid if its diameter and radius contains non-zero values, description is optional.
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the validity state of the row.
◆ IsRowValidByReferenceId()
 Result< bool > ACAPI::MEP::v1::DuctElbowPreferenceTable::IsRowValidByReferenceId  |  ( |  uint32_t  |  referenceId | ) |   const
A row is considered valid if its diameter and radius contains non-zero values, description is optional.
Parameters
referenceId | The referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
Returns
Returns error if the referenceId is not in the DuctReferenceSet, otherwise returns the validity state of the row.
◆ Modifier()
 ACAPI::MEP::v1::DuctElbowPreferenceTable::Modifier  |  ( |  DuctElbowPreferenceTable &  |  parent | )
protected
Constructs a Modifier with the given DuctElbowPreferenceTable.
Parameters
parent | The given DuctElbowPreferenceTable.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::DuctElbowPreferenceTable::Modify  |  ( |  const ModifierFunc &  |  modifierFunc,
|  const GS::UniString &  |  undoString
)
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ SetDescription()
 Result< void > ACAPI::MEP::v1::DuctElbowPreferenceTable::SetDescription  |  ( |  uint32_t  |  index,
|  const GS::UniString &  |  description
)
Sets the description of a table's row.
Parameters
index | The index of the row. Index starts from 0.
description | The description to be set.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ SetDescriptionByReferenceId()
 Result< void > ACAPI::MEP::v1::DuctElbowPreferenceTable::SetDescriptionByReferenceId  |  ( |  uint32_t  |  referenceId,
|  const GS::UniString &  |  description
)
Sets the description of a table's row.
Parameters
referenceId | The referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
description | The description to be set.
If there isn't any row with the given referenceId, but the referenceId is defined in the DuctReferenceSet, it will insert the row.
Returns
Returns error if the referenceId is not in the DuctReferenceSet, otherwise nothing.
◆ SetDiameter()
 Result< void > ACAPI::MEP::v1::DuctElbowPreferenceTable::SetDiameter  |  ( |  uint32_t  |  index,
|  double  |  diameter
)
Sets the diameter value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
diameter | The value to be set. Must be a non-zero positive number.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ SetDiameterByReferenceId()
 Result< void > ACAPI::MEP::v1::DuctElbowPreferenceTable::SetDiameterByReferenceId  |  ( |  uint32_t  |  referenceId,
|  double  |  diameter
)
Sets the diameter value of a table's row.
Parameters
referenceId | The referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
diameter | The value to be set. Must be a non-zero positive number.
If there isn't any row with the given referenceId, but the referenceId is defined in the DuctReferenceSet, it will insert the row.
Returns
Returns error if the referenceId is not in the DuctReferenceSet, otherwise nothing.
◆ SetName()
 void ACAPI::MEP::v1::DuctElbowPreferenceTable::SetName  |  ( |  const GS::UniString &  |  tableName | )
Sets the name of the table.
Parameters
tableName | The name to be set.
◆ SetRadius()
 Result< void > ACAPI::MEP::v1::DuctElbowPreferenceTable::SetRadius  |  ( |  uint32_t  |  index,
|  double  |  radius
)
Sets the radius value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
radius | The value to be set. Must be a non-zero positive number. Radius must be greater or equal than 0.6 * diameter.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ SetRadiusByReferenceId()
 Result< void > ACAPI::MEP::v1::DuctElbowPreferenceTable::SetRadiusByReferenceId  |  ( |  uint32_t  |  referenceId,
|  double  |  radius
)
Sets the radius value of a table's row.
Parameters
referenceId | The referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
radius | The value to be set. Must be a non-zero positive number. Radius must be greater or equal than 0.6 * diameter.
If there isn't any row with the given referenceId, but the referenceId is defined in the DuctReferenceSet, it will insert the row.
Returns
Returns error if the referenceId is not in the DuctReferenceSet, otherwise nothing.